# 此类专门用于十六进制和二进制字符串的转换
# 可能python有对应的类，但这并不是现在需要考虑的事情
hex2bin_map = {
   "0":"0000",
   "1":"0001",
   "2":"0010",
   "3":"0011",
   "4":"0100",
   "5":"0101",
   "6":"0110",
   "7":"0111",
   "8":"1000",
   "9":"1001",
   "A":"1010",
   "B":"1011",
   "C":"1100",
   "D":"1101",
   "E":"1110",
   "F":"1111",
}

bin2hex_map = {
   "0000":"0",
   "0001":"1",
   "0010":"2",
   "0011":"3",
   "0100":"4",
   "0101":"5",
   "0110":"6",
   "0111":"7",
   "1000":"8",
   "1001":"9",
   "1010":"A",
   "1011":"B",
   "1100":"C",
   "1101":"D",
   "1110":"E",
   "1111":"F"
}
def hex_str_to_binary_str(hex_str):
    tmp = ""
    for i in hex_str:
        tmp = tmp + hex2bin_map[i]
    return tmp
def binary_str_to_hex_str(binary_str):
    tmp = ""
    ll = len(binary_str)
    # 这样写为什么不会报bug呢？
    for i in range(0, ll, 4):
        # 应当是不会下标越界的
        tmp = tmp + bin2hex_map[binary_str[i:i+4]]
    return tmp